Repository: swirly0p/CTCGFW-luci
Catalog: applications/luci-app-polipo/po/*/polipo.po
Languages: ga

source: Advanced Settings
ga: Socruithe chun cinn

source: Allowed clients
ga: Cliaint ceadaithe

source: Always use system DNS resolver
ga: Úsáid réititheoir DNS an chórais i gcónaí

source: Basic HTTP authentication supported. Provide username and password in username:password format.
ga: Tacaítear le fíordheimhniú bunúsach HTTP. Cuir ainm úsáideora agus pasfhocal ar fáil i bhformáid ainm úsáideora: pasfhocal.

source: Configuration
ga: Cumraíocht

source: DNS and Query Settings
ga: DNS agus Socruithe Iarratas

source: DNS server address
ga: Seoladh freastalaí DNS

source: Delete cache files time
ga: Scrios am comhaid taisce

source: Disk cache location
ga: Suíomh taisce diosca

source: Do not query IPv6
ga: Ná fiafraigh IPv6

source: Enable if cache (proxy) is shared by multiple users.
ga: Cumasaigh má tá an taisce (seachfhreastalaí) roinnte ag úsáideoirí iolracha.

source: First PMM segment size (in bytes)
ga: Méid an chéad mhír PMM (i mbeart)

source: General Settings
ga: Socruithe Ginearálta

source: Grant UCI access for luci-app-polipo
ga: Tabhair rochtain do UCI ar luci-app-polipo

source: How much RAM should Polipo use for its cache.
ga: Cé mhéad RAM ba chóir do Polipo a úsáid dá thaisce.

source: In RAM cache size (in bytes)
ga: I méid taisce RAM (i mbeart)

source: Listen address
ga: Éist leis an seoladh

source: Listen port
ga: Éist port

source: Location where polipo will cache files permanently. Use of external storage devices is recommended, because the cache can grow considerably. Leave it empty to disable on-disk cache.
ga: Suíomh ina dtaiscfidh polipo comhaid go buan. Moltar feistí stórála seachtracha a úsáid, mar is féidir leis an taisce fás go mór. Fág folamh é chun an taisce ar an diosca a dhíchumasú.

source: Log file location
ga: Logchomhaid suíomh

source: Log to syslog
ga: Logáil chuig syslog

source: Logging and RAM
ga: Logáil agus RAM

source: Never use system DNS resolver
ga: Ná húsáid réititheoir DNS an chórais choíche

source: On-Disk Cache
ga: Taisce ar an Diosca

source: PMM segments size (in bytes)
ga: Méid na gcodanna PMM (i mbeart)

source: Parent Proxy
ga: Seachfhreastalaí Tuismitheora

source: Parent proxy address
ga: Seoladh seachfhreastalaí tuismitheora

source: Parent proxy address (in host:port format), to which Polipo will forward the requests.
ga: Seoladh seachfhreastalaí tuismitheora (i bhformáid ósta:port), a gcuirfidh Polipo na hiarratais ar aghaidh chuige.

source: Parent proxy authentication
ga: Fíordheimhniú seachfhreastalaí tuismitheora

source: Polipo Status
ga: Stádas Polipo

source: Polipo is a small and fast caching web proxy.
ga: Is seachfhreastalaí gréasáin taisceadh beag agus tapa é Polipo.

source: Poor Man's Multiplexing
ga: Ilphléacsú Fear na mBocht

source: Poor Man's Multiplexing (PMM) is a technique that simulates multiplexing by requesting an instance in multiple segments. It tries to lower the latency caused by the weakness of HTTP protocol. NOTE: some sites may not work with PMM enabled.
ga: Teicníc is ea Iolphléacsú Fear na mBocht (PMM) a shamhlaíonn ilphléacsáil trí shampla a iarraidh i míreanna iolracha. Déanann sé iarracht an latency de bharr laige prótacal HTTP a ísliú. TABHAIR FAOI DEARA: seans nach n-oibreoidh roinnt suíomhanna le PMM cumasaithe.

source: Port on which Polipo will listen
ga: Port ar a mbeidh Polipo ag éisteacht

source: Proxy
ga: Seachfhreastalaí

source: Query DNS by hostname
ga: Iarratas DNS de réir óstainm

source: Query DNS directly, fallback to system resolver
ga: Cuir ceist DNS go díreach, cúltacaire don réititheoir córais

source: Query DNS directly, for unknown hosts fall back to system resolver
ga: Iarr ar DNS go díreach, le haghaidh óstaigh anaithnid titim ar ais go dtí réititheoir an chórais

source: Query DNS for IPv6
ga: Iarratas DNS le haghaidh IPv6

source: Query IPv4 and IPv6, prefer IPv4
ga: Iarratas IPv4 agus IPv6, is fearr IPv4

source: Query IPv4 and IPv6, prefer IPv6
ga: Iarratas IPv4 agus IPv6, is fearr IPv6

source: Query only IPv6
ga: Iarratas amháin IPv6

source: Set the DNS server address to use, if you want Polipo to use different DNS server than the host system.
ga: Socraigh an seoladh freastalaí DNS a úsáid, más mian leat Polipo a úsáid freastalaí DNS difriúil ná an córas óstach.

source: Shared cache
ga: Taisce roinnte

source: Size of the first PMM segment. If not defined, it defaults to twice the PMM segment size.
ga: Méid an chéad deighleog PMM. Mura bhfuil sé sainithe, mainneachtainí sé dhá oiread mhéid na míre PMM.

source: Size to which cached files should be truncated
ga: Méid ar cheart comhaid i dtaisce a theorannú

source: Status
ga: Stádas

source: Syslog facility
ga: Áis Syslog

source: The interface on which Polipo will listen. To listen on all interfaces use 0.0.0.0 or :: (IPv6).
ga: An comhéadan ar a mbeidh Polipo ag éisteacht. Chun éisteacht ar gach comhéadain úsáid 0.0.0.0 nó :: (IPv6).

source: Time after which cached files will be deleted
ga: Am ina dhiaidh sin scriosfar comhaid i dtaisce

source: Time after which cached files will be truncated
ga: An t-am ina dhiaidh sin gearrfar comhaid i dtaisce

source: To enable PMM, PMM segment size must be set to some positive value.
ga: Chun PMM a chumasú, ní mór méid na míre PMM a shocrú go luach dearfach éigin.

source: Truncate cache files size (in bytes)
ga: Gearr méid comhaid taisce (i mbeart)

source: Truncate cache files time
ga: Gearr am comhaid taisce

source: Use of external storage device is recommended, because the log file is written frequently and can grow considerably.
ga: Moltar gléas stórála seachtrach a úsáid, toisc go scríobhtar an comhad logála go minic agus go bhféadfadh sé fás go mór.

source: When listen address is set to 0.0.0.0 or :: (IPv6), you must list clients that are allowed to connect. The format is IP address or network address (192.168.1.123, 192.168.1.0/24, 2001:660:116::/48 (IPv6))
ga: Nuair atá an seoladh éisteachta socraithe go 0.0.0.0 nó :: (IPv6), ní mór duit liosta a dhéanamh de na cliaint a bhfuil cead acu nascadh. Is í an fhormáid seoladh IP nó seoladh líonra (192.168.1.123, 192.168.1.0/24, 2001: 660:116::/48 (IPv6))

source: enable
ga: chumasú
